docs/db.md
```mermaid
erDiagram
direction LR
EVENTS {
  bigint id PK
  string name
  jsonb settings
  jsonb statistics
  datetime created_at
  datetime updated_at
}

USERS {
  bigint id PK
  string name
  string lastname
  string nick
  boolean is_male
  date dob
  string email
  string phone
  boolean is_admin
  string password_digest
  string password_reset_token
  datetime password_reset_sent_at
  string country
  string state
  string city
  jsonb guest_history
  datetime created_at
  datetime updated_at
}

REGISTRIES {
  bigint id PK
  bigint user_id FK
  bigint event_id FK
  text comments
  boolean is_confirmed
  boolean is_present
  boolean is_notified
  integer amount_debt
  integer amount_paid
  integer amount_offering
  bigint paid_by
  datetime created_at
  datetime updated_at
}

GUESTS {
  bigint id PK
  bigint registry_id FK
  string name
  string lastname
  string nick
  boolean is_male
  integer age
  integer relation
  boolean is_pregnant
  boolean is_medicated
  datetime created_at
  datetime updated_at
}

PAYMENTS {
  bigint id PK
  bigint registry_id FK
  bigint user_id FK
  integer amount
  integer kind
  datetime created_at
  datetime updated_at
}

%% Relationships
USERS ||--o{ REGISTRIES : "has many"
EVENTS ||--o{ REGISTRIES : "has many"
REGISTRIES ||--o{ GUESTS : "has many"
REGISTRIES ||--o{ PAYMENTS : "has many"
USERS ||--o{ PAYMENTS : "has many"
```
